<template>
    <div>
        <div class="first">
            <!-- <el-button type="text" v-for="item in text" :key="item" :value="item">
                {{item}}
            </el-button> -->
                <!-- <label  v-for="item in text" :key="item" :value="item">{{item}}<br><br></label> -->
            <!-- <ul>
                <li v-for="item in text" :key="item">{{item}}</li>
            </ul> -->
            <el-link v-for="item in text" :key="item" :value="item" @click="ShowRe">
                {{item}}<br><br>

            </el-link>
        </div>
        <div class="second">
            <label  v-for="item in textarea" :key="item" :value="item" @dblclick="ShowTips" :underline="false">{{item}}<br><br></label>
        </div>
        <div class="third">
            <div class="button1">
                <el-button class="button1" @click="showConflict">
                    {{button_msg_1}}
                </el-button>
            </div><br>
            <div>
                <el-label style="margin-left: 5px">
                    更改审核状态：
                </el-label>
                <el-select v-model="auditState">
                    <el-option v-for="item in auditStates" :key="item" :value="item"></el-option>
                </el-select>
            </div>
            <div style="margin-top: 5px;margin-right:15px">
                <el-button style="float:right;" @click="SaveState">
                    保存
                </el-button>
            </div>
        </div>
    </div>
</template>

<script>
export default {
  name: 'Detail',
  data () {
    return {
      returninfo: {},
      textarea: [],
      text: [],
      typeinfo: Object,
      button_msg_1: '查看已添加的冲突项',
      conflictmsg: '这是冲突项',
      auditState: '',
      auditStates: ['审核完成', '审核未完成']
    }
  },
  methods: {
    ShowRe () {
      this.textarea = []
      console.log(this.type4info)
      var type4info = this.typeinfo[2].type4
      this.textarea = type4info
      console.log(this.textarea)
    },
    showConflict () {
      var msg = this.conflictmsg
      const ConflictPage = this.$router.resolve({ name: 'Edit', params: msg })
      window.open(ConflictPage.href, '_blank')
    },
    ShowTips () {
      this.$confirm('是否将此项添加到冲突项', '提示', {
        confirmButtonText: '确定',
        cancelButtonText: '取消',
        type: 'warning'
      }).then(() => {
        this.$message({
          type: 'success',
          message: '添加成功!'
        })
      }).catch(() => {
        this.$message({
          type: 'info',
          message: '已取消添加'
        })
      })
    },
    SaveState () {

    },
    updateView (e) {
      this.$forceUpdate()
    }
  },
  mounted () {
    console.log(this.$route.params)
    var textinfo = this.$route.params
    console.log(typeof (textinfo))
    console.log(textinfo[8])
    console.log(textinfo[8].returncontent)
    var textinfo_1 = textinfo[8].returncontent
    var data1 = {}
    data1 = JSON.parse(textinfo_1)
    // data1 = {"第一章总则": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第一条 为保证生活饮用水二次供水卫生安全,保障人民身体健康,根据《中华人民共和国传染病防治法》、《中华人民共和国城市供水条例》、《生活饮用水卫生监督管理 办法》和《城市供水水质管理规定》以及宜春市人民政府办公室《宜春市中心城区二次供水设施建设与改造实施方案》等有关法律法规的规定,结合我市实际,制定本办法。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["根据", "规定"]}, "第二条 本办法适用于本市行政区域内生活饮用水二次供水(以下简称二次供水)的卫生监督管理。": {"type1": [], "type2": [], "type3": [], "type4": ["@《生活饮用水卫生监督管理办法》:LCS_    第二条 本办法适用于集中式供水、二次供水单位(以下简称供水单位)和涉及饮用水卫生安全的产品的卫生监督管理。凡在中华人民共和国领域内的任何单位和个人均应遵守本办法。", "@《《生活饮用水卫生监督管理办法》》:LCS_    第二十九条 本办法下列用语的含义是:集中式供水:由水源集中取水,经统一净化处理和消毒后,由输水管网送至用户的供水方式(包括公共供水和单位自建设施供水)。二次供水:将来自集中式供水的管道另行加压、贮存,再送至水站或用户的供水设施;包括客运船舶、火车客车等交通运输工具上的供水(有独自制水设施者除外)。涉及饮用水卫生安全的产品:凡在饮用水生产和供水过程中与饮用水接触的联接止水材料、塑料及有机合成管材、管件、防护涂料、水处理剂、除垢剂、水质处理顺及其他新材料和化学物质。直接从事供、管水的人员:从事净水、取样、化验、二次供水卫生管理及水池、水箱清洗人员。", "@《江西省生活饮用水集中式供水单位卫生许可规程》:LCS_第一条 为加强生活饮用水集中式供水单位(以下简称集中式供水单位)的卫生监督管理,保证生活饮用水符合有关卫生规范,根据《生活饮用水卫生监督管理办法》,制定本规范。"], "type5": ["适用于"]}, "第三条 卫生健康行政部门负责全市二次供水的卫生监督监测工作。市综合行政执法部门负责全市二次供水的管理工作。县(市、区)人民政府城镇供水主管部门负责本行政区域内二次供水的日常管理工作。县级以上人民政府卫生行政审批机构负责本行政区域内二次供水的卫生许可审批工作。宜春市水务集团有限公司根据《宜春市中心城区二次供水设施建设与改造实施方案》的有关规定,接受产权单位有偿委托,对中心城区二次供水设施进行规范化管理。": {"type1": ["宜春市水务集团有限公司"], "type2": [], "type3": [], "type4": [], "type5": ["根据", "主管", "规定"]}, "第二章 建设管理": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第四条 二次供水单位新建、改建、扩建的二次供水工程项目,应当符合国家、省、市的有关标准规范及《宜春市中心城区二次供水设施建设与改造实施方案》的要求,方能投入使用。新建二次供水设施应当与主体工程同时设计、同时施工、同时验收、同时交付使用。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["符合", "标准"]}, "第五条 新建、改建、扩建的二次供水工程项目的选址、设计和竣工验收,由城镇供水主管部门负责组织审查和验收,卫生健康行政部门会同参与。": {"type1": [], "type2": [], "type3": [], "type4": ["@《生活饮用水卫生监督管理办法》:LCS_第八条 供水单位机关报建、改建、扩建的饮用水供水工程项目,应当符合卫生要求,选址和设计审查、竣工验收必须有住房城乡建设、卫生计生行政主管部门参加。新建、改建、扩建的城市公共饮用水供水工程项目由住房城乡建设主管部门负责组织选址、设计审查和竣工验收,卫生计生主管部门参加。"], "type5": ["主管"]}, "第六条 二次供水设施场所应保持环境整洁,应有良好的照明、通风、排水条件,供水设施应运转正常。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_4.1 设施周围应保持环境整洁,应有很好的排水条件,供水设施应运转正常。"], "type5": []}, "第七条 设施与饮水接触表面必须保证外观良好,光滑平整,不对饮水水质造成影响。通过设施所供给居民的饮水感官性状不应对人产生不良影响,不应含有危害人体健康的有毒有害物质,不引起肠道传染病发生或流行。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_4.3 通过设施所供给居民的饮水感官性状不应对人产生不良影响,不应含有危害人体健康的有毒有害物质,不引起肠道传染病发生或流行。"], "type5": ["必须"]}, "第八条 饮用水箱或蓄水池应专用,不得渗漏,设置在建筑物内的水箱其顶部与屋顶的距离应大于80cm,水箱应有相应的透气管和罩,入孔位置和大小要满足水箱内部清洗消毒工作的需要,入孔或水箱入口应有盖(或门),并高出水箱面5cm以上,并有上锁装置,水箱内外应设有爬梯。水箱必须安装在有排水条件的底盘上,泄水管应设在水箱的底部,溢水管与泄水管均不得与下水管道直接连通,水箱的材质和内壁涂料应无毒无害,不影响水的感观性状。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_51 设计水箱或蓄水池:饮用水箱或蓄水池应专用,不得渗漏,设置在建筑物内的水箱其顶部与屋顶的距离应大于80 cm,水箱应有相应的透气管和罩,入孔位置和大小要满足水箱内部清洗消毒工作的需要,入孔或水箱入口应有盖(或门),并高出水箱面5 cm以上,并有上锁装置,水箱内外应设有爬梯。水箱必须安装在有排水条件的底盘上,泄水管应设在水箱的底部,溢水管与泄水管均不得与下水管道直接连通,水箱的材质和内壁涂料应无毒无害,不影响水的感观性状。水箱的容积设计不得超过用户48 h的用水量。"], "type5": ["必须"]}, "第九条 设施不得与市政供水管道直接连通(使用直接管道增压的除外),也不得与非饮用水管道连接。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_5-2 设施不得与市政供水管道直接连通,在特殊情况下需要连通时必须设置不承压水箱。设施管道不得与非饮用水管道连接,如必须连接时,应采取防污染的措施。设施管道不得与大便口(槽)、小便斗直接连接,须用冲洗水箱或用空气隔断冲洗阀。"], "type5": []}, "第十条 设施须有安装消毒器的位置,有条件的单位设施应设有消毒器。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_5.3 设施须有安装消毒器的位置,有条件的单位设施应设有消毒器。"], "type5": []}, "第十一条 设计中使用的过滤、软化、净化、消毒设备、防腐涂料,必须有省级以上(含省级)卫生健康行政部门颁发的“涉水产品许可批件”。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_5.4 设汁中使用的过滤、软化、净化、消毒设备、防腐涂料,必须有省级以上(含省级)卫生部门颁发的“产品卫生安全性评价报告”。"], "type5": ["必须"]}, "第十二条 蓄水池周围10m以内不得有渗水坑和堆放的垃圾等污染源。水箱周围2m内不应有污水管线及污染物。": {"type1": [], "type2": [], "type3": [], "type4": ["@《二次供水设施卫生规范GB17051—1997》:LCS_5.5 蓄水池周围lom 以内不得有渗水坑和堆放的垃圾等污染源。水箱周围2m内不应有污管线及污染物"], "type5": []}, "第三章 卫生管理": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第十三条 二次供水管理单位负责二次供水设施的运行、维护保养与日常管理。无管理单位的二次供水设施,必须按照《宜春市中心城区二次供水设施建设与改造实施方案》及《江西省城镇生活饮用水二次供水工程技术规程》进行改造,竣工验收后,委托城镇供水企业统一管理维护。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["按照", "必须"]}, "第十四条 二次供水管理单位应当经常对二次供水设施进行检查、监测,并按供水规范要求对设备、设施进行维护保养,确保二次供水设施完好和运行正常。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第十五条 二次供水管理单位负责对二次供水设施的日常管理,保证二次供水水质符合国家生活饮用水卫生标准和规范的要求,并履行下列职责:": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["符合", "标准"]}, "(一)建立二次供水设施卫生管理制度,制定生活饮用水突发公共卫生事件应急处置预案,设立卫生管理组织,配备专(兼)职管理人员;": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "(二)按照《二次供水设施卫生规范》(GB17051-1997)、《城市供水水质管理规定》的规定,加强水质管理,每半年开展一次水质检测,并向用户公布水质检测结果;": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["按照", "规定"]}, "(三)对一次供水设施清洗消毒每年至少一次;二次供水设施清洗消毒后,送有资质的水质检测机构检测,向用户公布清洗、消毒的有关情况和检测结果;": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "(四) 每天定期对二次供水水质监测消毒剂余量,视消毒剂衰减情况及时加投药,使用物理消毒的二次供水单位,要确保消毒设施达转正常。同时,建立水质监测记录;": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "(五)建立卫生档案,将设施清洗消毒记录、供管水人员健康检查证明、水质监测台帐和检测报告等相关资料归档保存:": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "(六)保持二次供水设施场所环境整洁,周围无污水和垃圾等污染源。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第十六条 二次供水管理单位在二次供水设施(带饮用水箱或蓄水池)投入使用前应向当地县级以上卫生行政审批机构提出申请,取得卫生许可证后方可投入使用。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "许可申请材料参照《江西省生活饮用水集中式供水单位卫生许可规程》执行。": {"type1": [], "type2": [], "type3": [], "type4": ["@《江西省生活饮用水集中式供水单位卫生许可规程》:LCS_江西省生活饮用水集中式供水单位卫生规范", "@《《《江西省生活饮用水集中式供水单位卫生许可规程》》》:LCS_第二十九条 遇生活饮用水水质污染或不明原因水质突然恶化及水源性疾病暴发事件时,集中式供水单位须在发现上述情况后立即采取应急措施,以最快的方式报告当地卫生行政部门、建设行政部门。并及时进行水质检测,报送处理报告。", "@《《江西省生活饮用水集中式供水单位卫生许可规程》》:LCS_第一条 为加强生活饮用水集中式供水单位(以下简称集中式供水单位)的卫生监督管理,保证生活饮用水符合有关卫生规范,根据《生活饮用水卫生监督管理办法》,制定本规范。"], "type5": []}, "同一单位区域内的多套独立二次供水设施,需分别取得卫生许可证后方可使用。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "不带饮用水箱或蓄水池的二次供水设施,必须有省级以上(含省级)卫生健康行政部门颁发的“涉水产品许可批件”,并向当地卫生健康行政部门备案。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["必须"]}, "第十七条 直接从事二次供水设施供水、管水和清洗消毒作业的工作人员每年必须进行一次健康检查,取得健康体检和卫生知识培训合格证后方可上岗。": {"type1": [], "type2": [], "type3": [], "type4": ["@《江西省生活饮用水集中式供水单位卫生许可规程》:LCS_第三十七 条直接从事供、管水的人员必须每年进行一次健康检查。取得预防性健康体检合格证后方可上岗工作。", "@《生活饮用水卫生监督管理办法》:LCS_    第十一条 直接从事供、管水的人员必须取得体检合格证后方可上岗工作,并每年进行一次健康检查。凡患有痢疾、伤寒、病毒性肝炎、活动性肺结核、化脓性或渗出性皮肤病及其他有碍饮用水卫生的疾病的和病原携带者,不得直接从事供、管水工作。直接从事供、管水的人员,未经卫生知识培训不得上岗工作。"], "type5": ["必须"]}, "凡患有痢疚、伤寒、甲型病毒性肝炎、戊型病毒性肝炎等消化道传染病的人员,以及患有活动性肺结核、化脓性或者渗出性皮肤病等疾病的人员,治愈前不得直接从事供水、管水和清洗消毒工作。": {"type1": [], "type2": [], "type3": [], "type4": ["@《生活饮用水卫生监督管理办法》:LCS_    第十一条 直接从事供、管水的人员必须取得体检合格证后方可上岗工作,并每年进行一次健康检查。凡患有痢疾、伤寒、病毒性肝炎、活动性肺结核、化脓性或渗出性皮肤病及其他有碍饮用水卫生的疾病的和病原携带者,不得直接从事供、管水工作。直接从事供、管水的人员,未经卫生知识培训不得上岗工作。"], "type5": []}, "第十八条 二次供水水质消毒剂和设施清洗消毒使用的除垢剂、净水剂、消毒剂应符合国家有关生活饮用水涉水产品的卫生标准和规范。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["符合", "标准"]}, "第十九条 次供水设施管理单位可以自行或者委托专门从事二次供水储水设施清洗、消毒的单位,对二次供水储水设施进行清洗、消毒。": {"type1": [], "type2": [], "type3": [], "type4": ["@《城市供水水质管理规定》:LCS_违反本规定,有下列行为之一的,由直辖市、市、县人民政府城市供水主管部门给予警告,并处以3万元的罚款: (一)供水水质达不到国家有关标准规定的; (二)城市供水单位、二次供水管理单位未按规定进行水质检测或者委托检测的; (三)对于实施生产许可证管理的净水剂及与制水有关的材料等,选用未获证企业产品的; (四)城市供水单位使用未经检验或者检验不合格的净水剂及有关制水材料的; (五)城市供水单位使用未经检验或者检验不合格的城市供水设备、管网的; (六)二次供水管理单位,未按规定对各类储水设施进行清洗消毒的; (七)城市供水单位、二次供水管理单位隐瞒、缓报、谎报水质突发事件或者水质信息的; (八)违反本规定,有危害城市供水水质安全的其他行为的。"], "type5": []}, "自行开展二次供水储水设施清洗、消毒的二次供水设施管理单位以及专门从事二次供水储水设施清洗、消毒的单位,应当向单位注册地的卫生健康行政部门进行备案。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}, "第二十条 二次供水管理单位发现二次供水水质出现异常或受到污染,必须暂停供水,防止污染扩大并及时向卫生健康行政部门、城镇供水主管部门报告,待查清原因,消除隐患后方能恢女供水。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": ["必须", "主管"]}, "第二十一条 二次供水设施发生事故的,应由二次供水管理单位依法承担相应责任。": {"type1": [], "type2": [], "type3": [], "type4": [], "type5": []}}
    var data = []
    data.push(data1)
    console.log(data)
    var datakey = []// 存放key
    var datavalue = []// 存放value
    var i = data.length
    console.log(i)
    console.log(data[0])
    for (var key in data[0]) {
      datakey.push(key)
      console.log(key)
      this.text.push(key)
      datavalue.push(data[0][key])
      console.log(datavalue)
      this.typeinfo = datavalue
    }
  }
}

</script>

<style>
 .first {
    width: 49%;
    float:left;
    border: 1px solid #3B6273;
    height: 500px;
    overflow:scroll

}
.second {
    width: 49%;
    float:right;
    border: 1px solid #3B6273;
    height: 300px;
    overflow:scroll
}
.third{
    width: 49%;
    float:right;
    margin-top: 17px;
    border: 1px solid #3B6273;
    height: 180px;
}
.button1{
    margin-top: 3px;
    margin-left: 3px;

}
.richtext{
    height:280px;
}
</style>
